<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Using-SQLite" data-toc-modified-id="Using-SQLite-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Using SQLite</a></span><ul class="toc-item"><li><span><a href="#Advantages-of-SQLite" data-toc-modified-id="Advantages-of-SQLite-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Advantages of SQLite</a></span></li><li><span><a href="#The-sqlite3-Command-Line-Utility" data-toc-modified-id="The-sqlite3-Command-Line-Utility-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>The <code>sqlite3</code> Command Line Utility</a></span></li><li><span><a href="#The-sqlite3-package" data-toc-modified-id="The-sqlite3-package-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>The <code>sqlite3</code> package</a></span><ul class="toc-item"><li><span><a href="#Adding-data" data-toc-modified-id="Adding-data-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Adding data</a></span></li><li><span><a href="#Adding-data-from-a-csv-file" data-toc-modified-id="Adding-data-from-a-csv-file-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Adding data from a csv file</a></span></li><li><span><a href="#Deleting-Rows" data-toc-modified-id="Deleting-Rows-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Deleting Rows</a></span></li><li><span><a href="#Filtering-Rows" data-toc-modified-id="Filtering-Rows-1.3.4"><span class="toc-item-num">1.3.4&nbsp;&nbsp;</span>Filtering Rows</a></span></li></ul></li><li><span><a href="#Pandas-connector" data-toc-modified-id="Pandas-connector-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Pandas connector</a></span></li><li><span><a href="#Writing-data-into-a-database" data-toc-modified-id="Writing-data-into-a-database-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Writing data into a database</a></span></li></ul></li><li><span><a href="#Discussion" data-toc-modified-id="Discussion-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Discussion</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#SELECT-Statement" data-toc-modified-id="SELECT-Statement-2.0.1"><span class="toc-item-num">2.0.1&nbsp;&nbsp;</span>SELECT Statement</a></span></li><li><span><a href="#WHERE-Clause" data-toc-modified-id="WHERE-Clause-2.0.2"><span class="toc-item-num">2.0.2&nbsp;&nbsp;</span>WHERE Clause</a></span></li></ul></li><li><span><a href="#AGGREGATIONS" data-toc-modified-id="AGGREGATIONS-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>AGGREGATIONS</a></span></li><li><span><a href="#Read-Order-Data" data-toc-modified-id="Read-Order-Data-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Read Order Data</a></span><ul class="toc-item"><li><span><a href="#1.-Read-CSV-into-DataFrame" data-toc-modified-id="1.-Read-CSV-into-DataFrame-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>1. Read CSV into DataFrame</a></span></li><li><span><a href="#2.-Replace-Space-with-Underscore-in-Column-Names" data-toc-modified-id="2.-Replace-Space-with-Underscore-in-Column-Names-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>2. Replace Space with Underscore in Column Names</a></span></li><li><span><a href="#3.-Check-DataTypes" data-toc-modified-id="3.-Check-DataTypes-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>3. Check DataTypes</a></span></li><li><span><a href="#4.-Save-these-two-dataframes-as-a-table-in-sqlite" data-toc-modified-id="4.-Save-these-two-dataframes-as-a-table-in-sqlite-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>4. Save these two dataframes as a table in sqlite</a></span></li><li><span><a href="#5.-Select-Number-of-Orders-for-Each-Customer" data-toc-modified-id="5.-Select-Number-of-Orders-for-Each-Customer-2.2.5"><span class="toc-item-num">2.2.5&nbsp;&nbsp;</span>5. Select Number of Orders for Each Customer</a></span></li><li><span><a href="#6.-Select-Number-of-Customers-for-Each-Country" data-toc-modified-id="6.-Select-Number-of-Customers-for-Each-Country-2.2.6"><span class="toc-item-num">2.2.6&nbsp;&nbsp;</span>6. Select Number of Customers for Each Country</a></span></li><li><span><a href="#7.A-Select-discount,-sales,-quantity-for-Each-Order-from-orders_break_down-Table" data-toc-modified-id="7.A-Select-discount,-sales,-quantity-for-Each-Order-from-orders_break_down-Table-2.2.7"><span class="toc-item-num">2.2.7&nbsp;&nbsp;</span>7.A Select discount, sales, quantity for Each Order from orders_break_down Table</a></span></li><li><span><a href="#7.B-Select-discount,-sales,-quantity,-total-price-for-Each-Order-from-orders_break_down-Table" data-toc-modified-id="7.B-Select-discount,-sales,-quantity,-total-price-for-Each-Order-from-orders_break_down-Table-2.2.8"><span class="toc-item-num">2.2.8&nbsp;&nbsp;</span>7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table</a></span></li><li><span><a href="#7.C-Select-All-Orders-from-orders_break_down-Table-Where-Total-Price-Greater-Than-100" data-toc-modified-id="7.C-Select-All-Orders-from-orders_break_down-Table-Where-Total-Price-Greater-Than-100-2.2.9"><span class="toc-item-num">2.2.9&nbsp;&nbsp;</span>7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100</a></span></li><li><span><a href="#8.-Select-All-Customer-And-The-Product-They-Have-Bought" data-toc-modified-id="8.-Select-All-Customer-And-The-Product-They-Have-Bought-2.2.10"><span class="toc-item-num">2.2.10&nbsp;&nbsp;</span>8. Select All Customer And The Product They Have Bought</a></span></li><li><span><a href="#9.A-Select-Number-of-'Furniture'-Orders-For-Each-Country" data-toc-modified-id="9.A-Select-Number-of-'Furniture'-Orders-For-Each-Country-2.2.11"><span class="toc-item-num">2.2.11&nbsp;&nbsp;</span>9.A Select Number of 'Furniture' Orders For Each Country</a></span></li><li><span><a href="#9.B-Select-Number-of-'Furniture'-Orders-For-The-Country-Denmark" data-toc-modified-id="9.B-Select-Number-of-'Furniture'-Orders-For-The-Country-Denmark-2.2.12"><span class="toc-item-num">2.2.12&nbsp;&nbsp;</span>9.B Select Number of 'Furniture' Orders For The Country Denmark</a></span></li><li><span><a href="#10.-Select-Total-Sales-With-Discount-and-Without-Discount-for-Each-Country" data-toc-modified-id="10.-Select-Total-Sales-With-Discount-and-Without-Discount-for-Each-Country-2.2.13"><span class="toc-item-num">2.2.13&nbsp;&nbsp;</span>10. Select Total Sales With Discount and Without Discount for Each Country</a></span></li><li><span><a href="#11.A-Select-Total-Quantity,-Total-Sales-for-Each-Country" data-toc-modified-id="11.A-Select-Total-Quantity,-Total-Sales-for-Each-Country-2.2.14"><span class="toc-item-num">2.2.14&nbsp;&nbsp;</span>11.A Select Total Quantity, Total Sales for Each Country</a></span></li><li><span><a href="#11.B-Select-Top-3-Country-Based-on-Sales" data-toc-modified-id="11.B-Select-Top-3-Country-Based-on-Sales-2.2.15"><span class="toc-item-num">2.2.15&nbsp;&nbsp;</span>11.B Select Top 3 Country Based on Sales</a></span></li><li><span><a href="#11.C-Select-Bottom-3-Country-Based-On-Quantities" data-toc-modified-id="11.C-Select-Bottom-3-Country-Based-On-Quantities-2.2.16"><span class="toc-item-num">2.2.16&nbsp;&nbsp;</span>11.C Select Bottom 3 Country Based On Quantities</a></span></li><li><span><a href="#12.-Select-Average-Sales-By-Categroy-For-The-Country-'France'" data-toc-modified-id="12.-Select-Average-Sales-By-Categroy-For-The-Country-'France'-2.2.17"><span class="toc-item-num">2.2.17&nbsp;&nbsp;</span>12. Select Average Sales By Categroy For The Country 'France'</a></span></li><li><span><a href="#13.-Select-Country,-Category-and-Total-Sales-Where-Average-Total-Sales-is-The-Highest" data-toc-modified-id="13.-Select-Country,-Category-and-Total-Sales-Where-Average-Total-Sales-is-The-Highest-2.2.18"><span class="toc-item-num">2.2.18&nbsp;&nbsp;</span>13. Select Country, Category and Total Sales Where Average Total Sales is The Highest</a></span></li></ul></li><li><span><a href="#JOINS" data-toc-modified-id="JOINS-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>JOINS</a></span></li><li><span><a href="#ADDITIONAL-RESOURCES" data-toc-modified-id="ADDITIONAL-RESOURCES-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>ADDITIONAL RESOURCES</a></span></li></ul></li></ul></div>

<a href="https://colab.research.google.com/github/ikfaisal/dsia/blob/master/DSIA_Lab_2_1_3_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://bit.ly/2Ooh01X)

# Lab 2.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [6]:
import sqlite3
sqlite_db = '../../data/test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [7]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

In [8]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [9]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command
c.execute("INSERT INTO houses VALUES (?, ?, ?, ?, ?)", last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [10]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
# 
c.executemany("INSERT INTO houses VALUES (?, ?, ?, ?, ?)", recent_sales)

conn.commit()

Select all rows from houses

In [11]:
# A
c.execute("SELECT * FROM houses")
print(c.fetchall())

[(1, 4000, 5, 22, 619000), (2, 2390, 4, 34, 319000), (3, 1870, 3, 14, 289000), (4, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [1]:
import numpy as np

In [2]:
# import into nparray of ints, then convert to list of lists:
data = np.genfromtxt('../../data/housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [3]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [4]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [12]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [13]:
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [14]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

ANSWER: Deletes all records from `houses` table.

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [15]:
# A

results = c.execute('SELECT * FROM houses WHERE bdrms = 4')
results.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [16]:
#ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1827.5555555555557, 322892.51851851854),
 (4, 2399.733333333333, 373553.13333333336),
 (5, 4239.0, 659450.0)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [18]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [19]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('../../data/housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [20]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

Run a query to get the average price of each house size from this table:

In [25]:
#ANSWER

query = """
        SELECT sqft AS house_size, AVG(price) AS avg_price 
        FROM houses_pandas
        GROUP BY sqft
        """

pd.read_sql_query(query, conn)

    house_size  avg_price
0          852   179900.0
1         1000   169900.0
2         1100   249900.0
3         1200   299000.0
4         1203   239500.0
5         1236   199900.0
6         1239   229900.0
7         1268   259900.0
8         1320   299900.0
9         1380   212000.0
10        1416   232000.0
11        1427   198999.0
12        1437   249900.0
13        1458   464500.0
14        1494   242500.0
15        1534   314900.0
16        1600   329900.0
17        1604   242900.0
18        1664   368500.0
19        1767   252900.0
20        1811   285900.0
21        1839   349900.0
22        1852   299900.0
23        1888   255000.0
24        1890   329999.0
25        1940   239999.0
26        1962   259900.0
27        1985   299900.0
28        2000   347000.0
29        2040   314900.0
30        2104   399900.0
31        2132   345000.0
32        2162   287000.0
33        2200   475000.0
34        2238   329900.0
35        2300   449900.0
36        2400   369000.0
37        2526   469000.0
38        2567   314000.0
39        2609   499998.0
40        2637   299900.0
41        3000   539900.0
42        3031   599000.0
43        3137   579900.0
44        3890   573900.0
45        4215   549000.0
46        4478   699900.0

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [26]:
# Reading CSV to Dataframe
orders = pd.read_csv('../../data/P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('../../data/P12-OrderBreakdown.csv', encoding = 'utf-8')

In [27]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [28]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [33]:
# Save column names of orders to list
orders_colnames = orders.columns.tolist()

# Replace spaces in each element in list with _
new_orders_colnames = [name.replace(' ', '_') for name in orders_colnames]

# Assign new colname list to orders.columns
orders.columns = new_orders_colnames

In [39]:
def replace_column_names(df, to_replace, value):
    
    '''
    Replace characters in column names with value
    
    _params_:
    df: pandas DataFrame with column names to replace
    to_replace: str to replace in column names
    value: str to replace with in column names
    
    Returns pandas DataFrame with new column names
    
    '''
    
    colnames = df.columns.tolist()
    new_colnames = [name.replace(to_replace, value) for name in colnames]
    df.columns = new_colnames
    
    return df

In [34]:
orders.head()

          Order_ID  Order_Date      Customer_Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [40]:
orders_break_down = replace_column_names(orders_break_down, ' ', '_')

orders_break_down.head()

,Order_ID,Product_Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 3. Check DataTypes

In [41]:
orders.dtypes

Order_ID         object
Order_Date       object
Customer_Name    object
Country          object
dtype: object

In [42]:
orders_break_down.dtypes

Order_ID         object
Product_Name     object
Discount        float64
Sales           float64
Quantity          int64
Category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [44]:
# Establishing Local DB connection
db_connection = sqlite3.connect('../../data/eshop.db.sqlite')

# Writing out DataFrames as SQL Table

orders.to_sql('orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql('orders_break_down', con = db_connection, if_exists = 'replace', index = False)

#### 5. Select Number of Orders for Each Customer

In [47]:
# Select Number of Orders for Each Customer

query = """
        SELECT Customer_Name AS Customer, COUNT(*) as "Num. Orders"
        FROM orders
        GROUP BY Customer_Name;
        """

pd.read_sql_query(query, db_connection).head()

          Customer  Num. Orders
0    Aaron Bergman           11
1    Aaron Hawkins            7
2   Aaron Smayling           12
3  Adam Bellavance            4
4        Adam Hart            8

In [88]:
# pandas method

orders['Customer_Name'].value_counts().sort_index().head()

Aaron Bergman      11
Aaron Hawkins       7
Aaron Smayling     12
Adam Bellavance     4
Adam Hart           8
Name: Customer_Name, dtype: int64

#### 6. Select Number of Customers for Each Country

In [50]:
# Select Number of Customers for Each Country

query = """
        SELECT Country, COUNT(DISTINCT Customer_Name) as "Num. Customers"
        FROM orders
        GROUP BY Country;
        """

pd.read_sql_query(query, db_connection).head()

   Country  Num. Customers
0  Austria             125
1  Belgium              66
2  Denmark              28
3  Finland              33
4   France             568

In [90]:
# pandas method

orders.groupby('Country')['Customer_Name'].nunique()

Country
Austria           125
Belgium            66
Denmark            28
Finland            33
France            568
Germany           505
Ireland            48
Italy             351
Netherlands       172
Norway             37
Portugal           36
Spain             306
Sweden             96
Switzerland        39
United Kingdom    473
Name: Customer_Name, dtype: int64

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [92]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table

query = """
        SELECT Discount, Sales, Quantity
        FROM orders_break_down
        GROUP BY order_ID
        """

pd.read_sql_query(query, db_connection).head()

   Discount  Sales  Quantity
0       0.1  229.0         9
1       0.0   58.0         2
2       0.0  148.0         3
3       0.0  224.0        11
4       0.0   13.0         2

In [96]:
# pandas method

orders_break_down.groupby('Order_ID')[['Discount', 'Sales', 'Quantity']].sum().head()

                 Discount   Sales  Quantity
Order_ID
ES-2011-1001989       0.1   229.0         9
ES-2011-1010958       0.0   198.0         8
ES-2011-1012469       0.0   148.0         3
ES-2011-1043483       0.0  1150.0        20
ES-2011-1058269       0.1  3469.0        12

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [54]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table

query = """
        SELECT Discount, Sales, Quantity, (Sales * Quantity - Discount) AS "Total Price"
        FROM orders_break_down
        GROUP BY order_ID
        """

pd.read_sql_query(query, db_connection).head()

   Discount  Sales  Quantity  Total Price
0       0.1  229.0         9       2060.9
1       0.0   58.0         2        116.0
2       0.0  148.0         3        444.0
3       0.0  224.0        11       2464.0
4       0.0   13.0         2         26.0

In [97]:
# pandas method

order_id_agg = orders_break_down.groupby('Order_ID')[['Discount', 'Sales', 'Quantity']].sum()
order_id_agg['Total Price'] = order_id_agg['Sales'] * order_id_agg['Quantity'] - order_id_agg['Discount']

order_id_agg.head()

                 Discount   Sales  Quantity  Total Price
Order_ID
ES-2011-1001989       0.1   229.0         9       2060.9
ES-2011-1010958       0.0   198.0         8       1584.0
ES-2011-1012469       0.0   148.0         3        444.0
ES-2011-1043483       0.0  1150.0        20      23000.0
ES-2011-1058269       0.1  3469.0        12      41627.9

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [98]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100

query = """
        SELECT Discount, Sales, Quantity, (Sales * Quantity - Discount) AS Total_Price
        FROM orders_break_down
        GROUP BY order_ID
        HAVING Total_Price > 100
        """

pd.read_sql_query(query, db_connection).head()

   Discount  Sales  Quantity  Total_Price
0       0.1  229.0         9       2060.9
1       0.0   58.0         2        116.0
2       0.0  148.0         3        444.0
3       0.0  224.0        11       2464.0
4       0.0   63.0         2        126.0

In [100]:
# pandas method

order_id_agg[order_id_agg['Total Price'] > 100].head()

                 Discount   Sales  Quantity  Total Price
Order_ID
ES-2011-1001989       0.1   229.0         9       2060.9
ES-2011-1010958       0.0   198.0         8       1584.0
ES-2011-1012469       0.0   148.0         3        444.0
ES-2011-1043483       0.0  1150.0        20      23000.0
ES-2011-1058269       0.1  3469.0        12      41627.9

#### 8. Select All Customer And The Product They Have Bought

In [58]:
# Select All Customer And The Product They Have Bought

query = """
        SELECT Customer_Name AS Customer, Product_Name AS Product
        FROM orders
        JOIN orders_break_down 
        ON orders.Order_ID = orders_break_down.Order_ID
        """

pd.read_sql_query(query, db_connection).head()

            Customer                                Product
0       Eugene Moren            Enermax Note Cards, Premium
1  Dorothy Dickinson     Dania Corner Shelving, Traditional
2     Arthur Prichep  Binney & Smith Sketch Pad, Easy-Erase
3     Grant Thornton             Boston Markers, Easy-Erase
4     Grant Thornton            Eldon Folders, Single Width

In [102]:
# pandas method

all_orders = pd.merge(orders, orders_break_down, on='Order_ID', how='outer')

all_orders[['Customer_Name', 'Product_Name']].head()

       Customer_Name                           Product_Name
0       Eugene Moren            Enermax Note Cards, Premium
1  Dorothy Dickinson     Dania Corner Shelving, Traditional
2     Arthur Prichep  Binney & Smith Sketch Pad, Easy-Erase
3     Grant Thornton             Boston Markers, Easy-Erase
4     Grant Thornton            Eldon Folders, Single Width

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [63]:
# Select Number of 'Furniture' Orders For Each Country

query = """
        SELECT Country, COUNT(Category) AS "Furniture Orders"
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        WHERE Category = 'Furniture'
        GROUP BY Country
        """

pd.read_sql_query(query, db_connection).head()

   Country  Furniture Orders
0  Austria                40
1  Belgium                20
2  Denmark                 9
3  Finland                16
4   France               299

In [104]:
# pandas method

furniture_orders = all_orders[all_orders['Category'] == 'Furniture']

furniture_orders['Country'].value_counts().sort_index()

Austria            40
Belgium            20
Denmark             9
Finland            16
France            299
Germany           264
Ireland            12
Italy             136
Netherlands        76
Norway              6
Portugal           10
Spain             123
Sweden             36
Switzerland        11
United Kingdom    180
Name: Country, dtype: int64

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [64]:
# Select Number of 'Furniture' Orders For The Country Denmark

query = """
        SELECT *
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        WHERE Category = 'Furniture' AND Country = 'Denmark'
        """

pd.read_sql_query(query, db_connection).head()

,Order_ID,Order_Date,Customer_Name,Country,Order_ID,Product_Name,Discount,Sales,Quantity,Category
0,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,ES-2011-1586186,"Office Star Bag Chairs, Set of Two",0.5,87.0,3,Furniture
1,IT-2012-4084224,2012-02-15,Mick Brown,Denmark,IT-2012-4084224,"Rubbermaid Door Stop, Ergonomic",0.6,17.0,1,Furniture
2,IT-2013-4649004,2013-05-31,Bart Folk,Denmark,IT-2013-4649004,"Novimex Executive Leather Armchair, Red",0.5,920.0,4,Furniture
3,ES-2013-3422294,2013-09-07,Dave Brooks,Denmark,ES-2013-3422294,"Advantus Door Stop, Duo Pack",0.6,36.0,2,Furniture
4,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Deflect-O Clock, Black",0.6,161.0,8,Furniture

In [105]:
# pandas method

all_orders[(all_orders['Category'] == 'Furniture') &
           (all_orders['Country'] == 'Denmark')]

,Order_ID,Order_Date,Customer_Name,Country,Product_Name,Discount,Sales,Quantity,Category
513,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,"Office Star Bag Chairs, Set of Two",0.5,87.0,3,Furniture
1604,IT-2012-4084224,2012-02-15,Mick Brown,Denmark,"Rubbermaid Door Stop, Ergonomic",0.6,17.0,1,Furniture
3934,IT-2013-4649004,2013-05-31,Bart Folk,Denmark,"Novimex Executive Leather Armchair, Red",0.5,920.0,4,Furniture
4667,ES-2013-3422294,2013-09-07,Dave Brooks,Denmark,"Advantus Door Stop, Duo Pack",0.6,36.0,2,Furniture
5656,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,"Harbour Creations Bag Chairs, Set of Two",0.5,32.0,1,Furniture
5657,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,"Deflect-O Clock, Black",0.6,161.0,8,Furniture
6449,ES-2014-1415600,2014-07-07,Damala Kotsonis,Denmark,"Deflect-O Door Stop, Duo Pack",0.6,70.0,4,Furniture
7529,IT-2014-1978058,2014-11-13,Anthony Jacobs,Denmark,"Harbour Creations Steel Folding Chair, Red",0.5,98.0,2,Furniture
7663,ES-2014-5784412,2014-11-25,Pete Kriz,Denmark,"Eldon Light Bulb, Black",0.6,50.0,5,Furniture

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [76]:
# Select Total Sales With Discount and Without Discount for Each Country

query = """
        SELECT t1.Country, discount_sales, non_discount_sales
        FROM (SELECT Country, SUM(Sales) AS discount_sales
              FROM orders
              JOIN orders_break_down
              ON orders.Order_ID = orders_break_down.Order_ID
              WHERE Discount > 0
              GROUP BY Country) AS t1
        JOIN (SELECT Country, SUM(Sales) AS non_discount_sales
              FROM orders
              JOIN orders_break_down
              ON orders.Order_ID = orders_break_down.Order_ID
              WHERE Discount = 0
              GROUP BY Country) AS t2
         ON t1.Country = t2.Country

        """

pd.read_sql_query(query, db_connection).head()

          Country  discount_sales  non_discount_sales
0          France        479892.0            129791.0
1         Germany        243257.0            245424.0
2           Italy         78645.0            174097.0
3           Spain         84507.0            164895.0
4  United Kingdom         89643.0            330854.0

In [81]:
# Alternatively, save a table of discount sales and non-discount sales grouped by country and join on country

query1 = """
         SELECT Country, SUM(Sales) AS discount_sales
         FROM orders
         JOIN orders_break_down
         ON orders.Order_ID = orders_break_down.Order_ID
         WHERE Discount > 0
         GROUP BY Country
         """

query2 = """
         SELECT Country, SUM(Sales) AS non_discount_sales
         FROM orders
         JOIN orders_break_down
         ON orders.Order_ID = orders_break_down.Order_ID
         WHERE Discount = 0
         GROUP BY Country
         """

table1 = pd.read_sql_query(query1, db_connection)
table2 = pd.read_sql_query(query2, db_connection)

pd.merge(table1, table2, on='Country', how='outer').fillna(0).sort_values('Country')

           Country  discount_sales  non_discount_sales
10         Austria             0.0             79382.0
11         Belgium             0.0             42320.0
0          Denmark          7763.0                 0.0
12         Finland             0.0             20702.0
1           France        479892.0            129791.0
2          Germany        243257.0            245424.0
3          Ireland         15998.0                 0.0
4            Italy         78645.0            174097.0
5      Netherlands         70313.0                 0.0
13          Norway             0.0             20529.0
6         Portugal         15106.0                 0.0
7            Spain         84507.0            164895.0
8           Sweden         30490.0                 0.0
14     Switzerland             0.0             24874.0
9   United Kingdom         89643.0            330854.0

#### 11.A Select Total Quantity, Total Sales for Each Country

In [67]:
# Select Total Quantity, Total Sales for Each Country

query = """
        SELECT Country, SUM(Sales) AS total_sales, SUM(Quantity) AS total_quantity
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        GROUP BY Country

        """

pd.read_sql_query(query, db_connection).head()

   Country  total_sales  total_quantity
0  Austria      79382.0             973
1  Belgium      42320.0             532
2  Denmark       7763.0             204
3  Finland      20702.0             201
4   France     609683.0            7329

In [106]:
# pandas method

all_orders.groupby('Country')[['Sales', 'Quantity']].sum().head()

            Sales  Quantity
Country
Austria   79382.0       973
Belgium   42320.0       532
Denmark    7763.0       204
Finland   20702.0       201
France   609683.0      7329

#### 11.B Select Top 3 Country Based on Sales

In [70]:
# Select Top 3 Country Based on Sales

query = """
        SELECT Country, SUM(Sales) AS total_sales, SUM(Quantity) AS total_quantity
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        GROUP BY Country
        ORDER BY total_sales DESC
        LIMIT 3;
        """

pd.read_sql_query(query, db_connection).head()

          Country  total_sales  total_quantity
0          France     609683.0            7329
1         Germany     488681.0            6179
2  United Kingdom     420497.0            4917

In [107]:
# pandas method

all_orders.groupby('Country')[['Sales', 'Quantity']].sum().sort_values('Sales', ascending=False).head(3)

                   Sales  Quantity
Country
France          609683.0      7329
Germany         488681.0      6179
United Kingdom  420497.0      4917

#### 11.C Select Bottom 3 Country Based On Quantities

In [71]:
# Select Bottom 3 Country Based On Quantities

query = """
        SELECT Country, SUM(Sales) AS total_sales, SUM(Quantity) AS total_quantity
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        GROUP BY Country
        ORDER BY total_quantity
        LIMIT 3;
        """

pd.read_sql_query(query, db_connection).head()

   Country  total_sales  total_quantity
0  Finland      20702.0             201
1  Denmark       7763.0             204
2   Norway      20529.0             261

In [108]:
# pandas method

all_orders.groupby('Country')[['Sales', 'Quantity']].sum().sort_values('Quantity').head(3)

           Sales  Quantity
Country
Finland  20702.0       201
Denmark   7763.0       204
Norway   20529.0       261

#### 12. Select Average Sales By Categroy For The Country 'France'

In [72]:
# Select Average Sales By Categroy For The Country 'France'

query = """
        SELECT Country, Category, AVG(Sales) AS avg_sales
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        WHERE Country = 'France'
        GROUP BY Category
        """

pd.read_sql_query(query, db_connection).head()

  Country         Category  total_sales
0  France        Furniture   582.314381
1  France  Office Supplies   167.217709
2  France       Technology   595.145078

In [110]:
# pandas method

all_orders[all_orders['Country'] == 'France'].groupby(['Country', 'Category'])['Sales'].mean().head()

Country  Category
France   Furniture          582.314381
         Office Supplies    167.217709
         Technology         595.145078
Name: Sales, dtype: float64

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [82]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest

query = """
        SELECT Country, Category, SUM(Sales) AS total_sales
        FROM orders
        JOIN orders_break_down
        ON orders.Order_ID = orders_break_down.Order_ID
        GROUP BY Country, Category
        ORDER BY AVG(Sales) DESC
        """

pd.read_sql_query(query, db_connection).head()

          Country    Category  total_sales
0     Switzerland  Technology      11737.0
1         Belgium  Technology      13591.0
2          Norway   Furniture       4224.0
3  United Kingdom  Technology     170315.0
4           Spain  Technology      88434.0

In [113]:
# pandas method

all_orders.groupby(['Country', 'Category'])['Sales'].agg([np.mean, np.sum]).sort_values('mean', ascending=False)[['sum']]

                                     sum
Country        Category
Switzerland    Technology        11737.0
Belgium        Technology        13591.0
Norway         Furniture          4224.0
United Kingdom Technology       170315.0
Spain          Technology        88434.0
Germany        Technology       195281.0
Finland        Furniture          9602.0
United Kingdom Furniture        107597.0
France         Technology       229726.0
               Furniture        174112.0
Norway         Technology        10416.0
Austria        Technology        27086.0
Switzerland    Furniture          5908.0
Austria        Furniture         21091.0
Spain          Furniture         62424.0
Germany        Furniture        133641.0
Finland        Technology         5000.0
Italy          Technology        89429.0
               Furniture         64767.0
Belgium        Furniture          8870.0
Portugal       Technology         4930.0
Netherlands    Furniture         28292.0
Ireland        Technology         7008.0
Netherlands    Technology        23350.0
Sweden         Furniture         10982.0
Portugal       Furniture          2962.0
Ireland        Furniture          2866.0
Denmark        Technology         2608.0
Sweden         Technology         7104.0
Belgium        Office Supplies   19859.0
Spain          Office Supplies   98544.0
Austria        Office Supplies   31205.0
France         Office Supplies  205845.0
Denmark        Furniture          1471.0
Finland        Office Supplies    6100.0
United Kingdom Office Supplies  142585.0
Portugal       Office Supplies    7214.0
Italy          Office Supplies   98546.0
Germany        Office Supplies  159759.0
Switzerland    Office Supplies    7229.0
Norway         Office Supplies    5889.0
Denmark        Office Supplies    3684.0
Sweden         Office Supplies   12404.0
Ireland        Office Supplies    6124.0
Netherlands    Office Supplies   18671.0

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax





> 
> 
>
>
>
>
>

> 


> 



>

>

>
>
>


> >>>>>


---



---


>>>>>> > > © 2019 Data Science Institute of Australia


---



---